WcfHarness/WcfHarness/RequestXmls/DeleteAuthorizationGrant_SoftDelete.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteAuthorizationGrant xmlns="http://www.tavisca.com/Vexiere/IAuthorizationGrant/2013/01">
      <deleteAuthorizationGrantRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:AuthorizationGrantId>1</a:AuthorizationGrantId>
        <a:IsHardDelete>false</a:IsHardDelete>
      </deleteAuthorizationGrantRequest>
    </DeleteAuthorizationGrant>
  </s:Body>
</s:Envelope>